In [1]:
# import dependencies
import pathlib as path
import numpy as np
import pandas as pd

In [2]:
# 2022 csv into dataframe
df_2022 = pd.read_csv("Resources/cleaned_billionaire.csv")
df_2022.head()

,rank,personName,age,finalWorth,category,country,gender_F,gender_M
0,1,Elon Musk,50,219000,16,26,0,1
1,2,Jeff Bezos,58,171000,11,26,0,1
2,3,Bernard Arnault & family,73,158000,17,40,0,1
3,4,Bill Gates,66,129000,11,26,0,1
4,5,Warren Buffett,91,118000,14,26,0,1

In [3]:
# 2018 csv into dataframe
df_2018 = pd.read_csv("Resources/cleaned_2018_billionaire.csv")
df_2018.head()

,rank,personName,age,finalWorth,category,country,gender_F,gender_M
0,1,Jeff Bezos,54,112000,8,20,0,1
1,2,Bill Gates,62,90000,8,20,0,1
2,3,Warren Buffett,87,84000,10,20,0,1
3,4,Bernard Arnault,69,72000,17,36,0,1
4,5,Mark Zuckerberg,33,71000,8,20,0,1

In [4]:
df_2022.dtypes

rank           int64
personName    object
age            int64
finalWorth     int64
category       int64
country        int64
gender_F       int64
gender_M       int64
dtype: object

In [5]:
df_2018.dtypes

rank           int64
personName    object
age            int64
finalWorth     int64
category       int64
country        int64
gender_F       int64
gender_M       int64
dtype: object

In [6]:
#find sum duplicated personName values in df_2022
df_2022.personName.duplicated().sum()

2

In [7]:
#find sum duplicated personName values in df_2018
df_2018.personName.duplicated().sum()

2

In [8]:
# Get list of duplicate rows based on 'personName' column for df_2022
# Using sort values
duplicate2022 = df_2022[df_2022.personName.duplicated(keep=False)].sort_values("personName")
duplicate2022

,rank,personName,age,finalWorth,category,country,gender_F,gender_M
1147,1163,Li Li,56,2700,2,53,0,1
2060,2076,Li Li,58,1400,2,53,0,1
535,536,Wang Yanqing & family,55,5100,1,53,0,1
1739,1729,Wang Yanqing & family,75,1700,1,53,1,0

In [9]:
# Get list of duplicate rows based on 'personName' column for df_2018
# Using sort values
duplicate2018 = df_2018[df_2018.personName.duplicated(keep=False)].sort_values("personName")
duplicate2018

,rank,personName,age,finalWorth,category,country,gender_F,gender_M
347,365,Jim Davis,74,5000,12,20,0,1
823,859,Jim Davis,57,2000,11,20,0,1
449,466,Robert Miller,84,4000,17,3,0,1
904,924,Robert Miller,72,2000,8,49,0,1

In [10]:
#pull value of row 1147 personName in df_2022
df_2022.at[1147,'personName']

'Li Li'

In [11]:
# update cell value with new personName
# Row 1147 for df_2022

df_2022.at[1147,'personName']= 'Li Li (Shenzhen Hepalink Pharmaceutical)'

df_2022.at[1147,'personName']

'Li Li (Shenzhen Hepalink Pharmaceutical)'

In [12]:
#pull value of row 2060 personName in df_2022
df_2022.at[2060,'personName']

'Li Li'

In [13]:
# update cell value with new personName
# Row 1147 for df_2022

df_2022.at[2060,'personName']= 'Li Li (Aier Eye Hospital Group)'

df_2022.at[2060,'personName']

'Li Li (Aier Eye Hospital Group)'

In [14]:
#pull value of row 535 personName in df_2022
df_2022.at[535,'personName']

'Wang Yanqing & family'

In [15]:
# update cell value with new personName
# Row 535 for df_2022

df_2022.at[535,'personName']= 'Wang Yanquing (Wuxi Lead Intelligent Equipment)'

df_2022.at[535,'personName']

'Wang Yanquing (Wuxi Lead Intelligent Equipment)'

In [16]:
#pull value of row 1739 personName in df_2022
df_2022.at[1739,'personName']

'Wang Yanqing & family'

In [17]:
# update cell value with new personName
# Row 1739 for df_2022

df_2022.at[1739,'personName']= 'Wang Yanquing (Weihai Guangwei Group)'

df_2022.at[1739,'personName']

'Wang Yanquing (Weihai Guangwei Group)'

In [18]:
#pull value of row 347 personName in df_2018
df_2018.at[347,'personName']

'Jim Davis'

In [19]:
# update cell value with new personName
# Row 347 for df_2018

df_2018.at[347,'personName']= 'Jim Davis & Family'

df_2018.at[347,'personName']

'Jim Davis & Family'

In [20]:
#pull value of row 823 personName in df_2018
df_2018.at[823,'personName']

'Jim Davis'

In [21]:
# no change to personName for row 83 of df_2018

In [22]:
#pull value of row 449 personName in df_2018
df_2018.at[449,'personName']

'Robert Miller'

In [23]:
# no change to personName for row 449 of df_2018

In [24]:
#pull value of row 904 personName in df_2018
df_2018.at[904,'personName']

'Robert Miller'

In [25]:
# update cell value with new personName
# Row 904 for df_2018

df_2018.at[904,'personName']= 'Robert G. Miller'

df_2018.at[904,'personName']

'Robert G. Miller'

In [28]:
# Get list of duplicate rows based on 'personName' column for df_2022
# check to see if duplicates no longer exist
duplicate2022_2 = df_2022[df_2022.personName.duplicated(keep=False)].sort_values("personName")
duplicate2022_2

Empty DataFrame
Columns: [rank, personName, age, finalWorth, category, country, gender_F, gender_M]
Index: []

In [29]:
# Get list of duplicate rows based on 'personName' column for df_2018
# check to see if duplicates no longer exist
duplicate2018_2 = df_2018[df_2018.personName.duplicated(keep=False)].sort_values("personName")
duplicate2018_2

Empty DataFrame
Columns: [rank, personName, age, finalWorth, category, country, gender_F, gender_M]
Index: []

In [30]:
#create new csv files specifically for SQL

file_path = "Resources/sql_cleaned_2022_billionaire.csv"
df_2022.to_csv(file_path, index=False)

In [31]:
file_path = "Resources/sql_cleaned_2018_billionaire.csv"
df_2018.to_csv(file_path, index=False)